spots = [
  { name: "恵比寿ガーデンプレイス", address: "東京都渋谷区恵比寿4-20", lat: 35.642186, lon: 139.713309 },
  { name: "スターバックスコーヒー代官山蔦屋書店", address: "東京都渋谷区猿楽町17−5", lat: 35.648870, lon: 139.699760 },
  { name: "スターバックスコーヒー中目黒駅前店", address: "東京都目黒区上目黒２丁目１番地１ 中目黒ゲートタウンタワー B１F", lat: 35.643602, lon: 139.699077 },
  { name: "COW BOOKS 中目黒", address: "東京都目黒区青葉台1-14-11", lat: 35.647715, lon: 139.695982 },
]

stations = [
  { name: "中目黒駅", lat: 35.644307, lon: 139.699160 },
  { name: "恵比寿駅", lat: 35.646690, lon: 139.710106 },
  { name: "代官山駅", lat: 35.648240, lon: 139.703500 },
  { name: "池尻大橋駅", lat: 35.650630, lon: 139.684600 },
]

areas = [
  {
    name: "中目黒エリア",
    coordinates: [
      [139.69300746917725, 35.64788092832728],
      [139.6939516067505, 35.644114489675275],
      [139.69064712524414, 35.64059201137997],
      [139.69892978668213, 35.63846449878154],
      [139.70317840576172, 35.643033349486984],
      [139.70073223114014, 35.64721832699104],
      [139.69300746917725, 35.64788092832728]
    ]
  }
]

spots.each { |spot| Spot.create(spot) }
stations.each { |station| Station.create(station) }
areas.each { |area| Area.create(area) }
